-- phpMyAdmin SQL Dump
-- version 4.2.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-06-24 11:57:31
-- 服务器版本： 5.6.21
-- PHP Version: 5.6.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `kaifanla`
--

-- --------------------------------------------------------

--
-- 表的结构 `kf_dish`
--

CREATE TABLE IF NOT EXISTS `kf_dish` (
`did` int(11) NOT NULL,
  `name` varchar(64) DEFAULT NULL,
  `price` float(6,2) DEFAULT NULL,
  `img_sm` varchar(64) DEFAULT NULL,
  `img_lg` varchar(64) DEFAULT NULL,
  `detail` varchar(2048) DEFAULT NULL,
  `material` varchar(2048) DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `kf_dish`
--

INSERT INTO `kf_dish` (`did`, `name`, `price`, `img_sm`, `img_lg`, `detail`, `material`) VALUES
(1, '【牡丹】', 36.00, 'p0281.jpg', 'p0281-l.jpg', '牡丹是芍药科、芍药属植物，为多年生落叶小灌木。花色泽艳丽，玉笑珠香，风流潇洒，富丽堂皇，素有“花中之王”的美誉。在栽培类型中，主要根据花的颜色，可分成上百个品种。”牡丹品种繁多，色泽亦多，以黄、绿、肉红、深红、银红为上品，尤其黄、绿为贵。牡丹花大而香，故又有“国色天香”之称。\r\n唐代刘禹锡有诗曰：“庭前芍药妖无格，池上芙蕖净少情。唯有牡丹真国色，花开时节动京城。”在清代末年，牡丹就曾被当作中国的国花。1985年5月牡丹被评为中国十大名花第二名。是中国特有的木本名贵花卉，有数千年的自然生长和1500多年的人工栽培历史。在中国栽培甚广，并早已引种世界各地。牡丹花被拥戴为花中之王，有关文化和绘画作品很丰富。', '牡丹花语——圆满，浓情，富贵，雍容华贵，吉祥和幸福'),
(2, '【风信子】', 16.50, 'p2679.jpg', 'p2679-l.jpg', '风信子是多年草本球根类植物，鳞茎卵形，有膜质外皮，皮膜颜色与花色成正相关，未开花时形如大蒜，原产地中海沿岸及小亚细亚一带，是研究发现的会开花的植物中最香的一个品种。喜阳光充足和比较湿润的生长环境，要求排水良好和肥沃的沙壤土等。\r\n全世界风信子的园艺品种约有2000种以上，主要分为“荷兰种”和“罗马种”两类。前者属正宗品种，绝大多数每株只长1支花葶，体势粗壮，花朵较大。而后者则多是变异的杂种，每株能着生二三支花葶，体势幼弱，花朵较细，多数消费者喜购荷兰风信子。', '风信子花语——只要点燃生命之火,便可同享丰富人生'),
(3, '【满天星】', 32.00, 'p8489.jpg', 'p8489-l.jpg', '满天星，原名：圆锥石头花，别名：锥花丝石竹、圆锥花丝石竹、丝石竹、锥花霞草、满天星，[1]  拉丁文名：Gypsophila paniculata L. 石竹科、石头花属多年生草本。产新疆阿尔泰山区和塔什库尔干。生于海拔1 100-1 500米河滩、草地、固定沙丘、石质山坡及农田中。哈萨克斯坦、俄罗斯（西伯利亚）、蒙古（西部）、欧洲（西部、中部和东部）、北美也有。根、茎可供药用。栽培可供观赏。', '满天星花语——清纯、关怀、恋爱、配角、真爱、纯洁美好的心灵.'),
(4, '【康乃馨】', 30.50, 'p7818.jpg', 'p7818-l.jpg', '康乃馨，原名：香石竹，英文名：Dianthus caryophyllus.又名：狮头石竹、麝香石竹、大花石竹，拉丁文名：Dianthus caryophyllus L. 石竹科、石竹属多年生草本，高40-70厘米，全株无毛，粉绿色。茎丛生，直立，基部木质化，上部稀疏分枝。叶片线状披针形，顶端长渐尖，基部稍成短鞘，中脉明显，上面下凹，下面稍凸起。花常单生枝端有香气，粉红、紫红或白色；花梗短于花萼；宽卵形，顶端短凸尖，花萼圆筒形，萼齿披针形，边缘膜质；瓣片倒卵形，顶缘具不整齐齿；雄蕊长达喉部；花柱伸出花外。蒴果卵球形，稍短于宿存萼。花期5-8月，果期8-9月。', '康乃馨花语——热情、魅力、使人柔弱的爱、真情、温馨的祝福、热爱着你、慈祥、不求代价的母爱、宽容、母亲之花。'),
(5, '【薰衣草】', 32.00, 'p9138.jpg', 'p9138-l.jpg', '薰衣草是属于唇形科的一个属，约28种，分布于大西洋群岛及地中海地区至索马里，巴基斯坦及印度；我国仅栽培2种。植株为半灌木或小灌木，稀为草本。因为可栽培的品种被广泛栽培在世界各地的栽培园里，人们偶尔也能在许多非原产地发现从园里飘逸出来的种子形成的野生状态的薰衣草族群。薰衣草的花期一般为6月至8月。因薰衣草喜阳光、耐热、耐旱、极耐寒、耐瘠薄、抗盐碱，栽培的场所需日照充足，通风良好。播种到开花（或采收）所需的时间为18～20周。薰衣草为半耐热性，好凉爽，喜冬暖夏凉，生长适温：15～25℃，在5～30℃均可生长。', '薰衣草花语——等待爱情,同时薰衣草也象征着纯洁、清净、保护、感恩与和平。'),
(6, '【郁金香】', 25.00, 'p4788.jpg', 'p4788-l.jpg', '郁金香（学名：Tulipa gesneriana），百合科郁金香属的草本植物，是土耳其、哈萨克斯坦、荷兰的国花。英文名：Flower of Common Tulip， Flower of Late Tulip ，中药名称：郁金香《本草拾遗》；郁金香《太平御览》；红蓝花、紫述香《纲目》。花叶3-5枚，条状披针形至卵状披针状，花单朵顶生，大型而艳丽，花被片红色或杂有白色和黄色，有时为白色或黄色，长5-7厘米，宽2-4厘米，6枚雄蕊等长，花丝无毛，无花柱，柱头增大呈鸡冠状，花期4-5月。[1] \r\n原产中国古代西域及西藏新疆一带，早在1300多年前，中国唐朝大诗人李白留下的“兰陵美酒郁金香，玉碗盛来琥珀光”即为明证。[2]  后经丝绸之路至传至中亚，又经中亚流入欧洲及世界各地。目前世界各地均有种植，是荷兰、新西兰、伊朗、土耳其、土库曼斯坦等国的国花，被称为世界花后，成为代表时尚和国际化的一个符号。', '郁金香花语——博爱.体贴.高雅.富贵.能干.聪颖，善良'),
(7, '【月季花】', 18.50, 'p7933.jpg', 'p7933-l.jpg', '月季花（学名：Rosa chinensis Jacq.）：被称为花中皇后，又称“月月红”，是常绿、半常绿低矮灌木，四季开花﹐一般为红色﹐或粉色、偶有白色和黄色﹐可作为观赏植物，也可作为药用植物，亦称月季。有三个自然变种，现代月季花型多样，有单瓣和重瓣，还有高心卷边等优美花型；其色彩艳丽、丰富，不仅有红、粉黄、白等单色，还有混色、银边等品种；多数品种有芳香。月季的品种繁多，世界上已有近万种，中国也有千种以上。\r\n   中国是月季的原产地之一。月季花荣秀美，姿色多样，四时常开，深受人们的喜爱，中国有52个城市将他选为市花，1985年5月月季被评为中国十大名花之五。', '月季花语——等待有希望的希望，幸福、光荣、美艳长新。'),
(8, '【茉莉花】', 12.00, 'p6611.jpg', 'p6611-l.jpg', '茉莉花，别名：茉莉，拉丁文名：Jasminum sambac (L.) Ait，木犀科、素馨属直立或攀援灌木，高达3米。小枝圆柱形或稍压扁状，有时中空，疏被柔毛。叶对生，单叶，叶片纸质，圆形、椭圆形、卵状椭圆形或倒卵形，两端圆或钝，基部有时微心形，在上面稍凹入或凹起，下面凸起，细脉在两面常明显，微凸起，除下面脉腋间常具簇毛外，其余无毛；裂片长圆形至近圆形，先端圆或钝。果球形，呈紫黑色。花期5-8月，果期7-9月。茉莉的花极香，为著名的花茶原料及重要的香精原料；花、叶药用治目赤肿痛，并有止咳化痰之效。', '茉莉花花语——素洁、浓郁、清芬、久远，具有忠贞、清纯、贞洁、质朴、玲珑、迷人的含义。');

-- --------------------------------------------------------

--
-- 表的结构 `kf_order`
--

CREATE TABLE IF NOT EXISTS `kf_order` (
`oid` int(11) NOT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `user_name` varchar(16) DEFAULT NULL,
  `sex` int(11) DEFAULT NULL,
  `order_time` mediumtext,
  `addr` varchar(256) DEFAULT NULL,
  `did` int(11) DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `kf_order`
--

INSERT INTO `kf_order` (`oid`, `phone`, `user_name`, `sex`, `order_time`, `addr`, `did`) VALUES
(1, '13501234567', '大旭', 1, '1445154859209', '大钟寺中鼎B座', 3),
(2, '13207654321', '东东', 1, '1445254997612', '万寿路文博大厦', 2),
(3, '13899999999', '文兄', 1, '1445354959209', '万寿路文博大厦', 5),
(4, '13683675299', '梅姐', 2, '1445354889209', '万寿路文博大厦', 4),
(7, '18591885015', 'allida', 2, '1465892881000', '唐城宾馆', 2),
(8, '18591885015', 'allida', 2, '1465892908000', '崇业东路', 3),
(24, '18591885015', 'allida', 2, '1466750549000', '长安北路8号', 2);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `kf_dish`
--
ALTER TABLE `kf_dish`
 ADD PRIMARY KEY (`did`);

--
-- Indexes for table `kf_order`
--
ALTER TABLE `kf_order`
 ADD PRIMARY KEY (`oid`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `kf_dish`
--
ALTER TABLE `kf_dish`
MODIFY `did` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=9;
--
-- AUTO_INCREMENT for table `kf_order`
--
ALTER TABLE `kf_order`
MODIFY `oid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=25;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
